#include "tobeknowndialog.h"
#include "ui_tobeknowndialog.h"

ToBeKnownDialog::ToBeKnownDialog(QWidget *parent , int a) :
    QDialog(parent),
    ui(new Ui::ToBeKnownDialog)
{
    ui->setupUi(this);

    switch(a)
    {
    case 1:
        ui->textBrowser->setText("***یک فروشگاه اینترنتی چه اطلاعاتی را در اختیار مشتریان قرار می دهد؟\n"
                                 "فروشندگان کالا به صورت مجازی باید اطلاعات دقیقی از محصول را که به خرید مصرف کنندگان کمک می کند در اختیار آنها قرار دهند.این اطلاعات شامل موارد زیر است:\n"
                                 "۱-مشخصات و ویژگی های کاربردی و فنی کالا و یا خدمات\n"
                                 "۲-نام تجاری که با آن نام به فعالیت مشغول می باشد و آدرس وی\n"
                                 "۳-شماره تماس، ایمیل و یا هر روشی که بتوان با سایت فروشنده کالا در صورت نیاز ارتباط برقرار کرد\n"
                                 "۴-زمانی که پیشنهاد ارائه شده دارای اعتبار است.\n"
                                 "۴-زمانی که پیشنهاد ارائه شده دارای اعتبار است.\n"
                                 "۵-شرایط خرید و فرآیند عقد قرارداد از جمله نحوه پرداخت و تحویل کالا و یا فسخ قراداد و ارجاع، خدمات پس از فروش\n"
                                 "۶- تمام هزینه های که به عهده خریدار کالا است( از جمله قیمت کالا، میزان مالیات، هزینه حمل و نقل)");
        break;

    case 2:
        ui->textBrowser->setText("برای خرید از دیجی‌کالا، حتما باید در سایت عضو باشم ؟\n"
                                 "بله. قبل از خرید میبایست از طریق شماره موبایل  ثبت نام کنید.\n"
                                 "چطور میتوانم مشخصات کاربری و ایمیل خود را ویرایش کنم؟\n"
                                 "با وارد کردن ایمیل (یا شماره ی همراه ) وارد حساب کاربری خود شوید. روی گزینه پروفایل کلیک کرده و در صفحه پروفایل اطلاعات خود را ویرایش کنید\n"
                                 "من دو حساب کاربری در دیجی‌کالا دارم، آیا می‌توانم آنها را ادغام کنم؟\n"
                                 "خیر\n"
                                 "چگونه یک کلمه عبور امن ایجاد کنیم ؟\n"
                                 "یکی از راه‌هایی که از نفوذ هکرها و مجرمان سایبری به حساب‌های کاربری و حریم شخصی شما جلوگیری می‌کند، ساخت و استفاده از یک گذرواژه قوی و غیرقابل حدس است.");
        break;
    case 3:
        ui->textBrowser->setText("گارانتی کالاها شامل چه مواردی می‏‌شود؟ چطور میتوانم از خدمات گارانتی استفاده کنم؟\n"
                                 "به این دلیل که گارانتی شرکت‏‌های مختلف بر اساس نوع کالا متفاوت است و بنابراین در اینجا پاسخگویی دقیق ممکن نیست، بهترین کار این است که با خود شرکت‌های گارانتی کننده تماس بگیرید.\n"
                                 "چطور گوشی جدید خود را فعال ( رجیستر ) کنم؟\n"
                                 "هر دستگاه نیازمند فعالسازی، باید از طریق سامانه همتا با واردکردن شناسه (IMEI)، شماره سیم کارت و کد فعال سازی، برای سیم کارت مورد نظر فعال سازی شود.\n"
                                 "اگر از خرید خود بعد از تحویل کالا منصرف شوم میتوانم آن را برگردانم؟\n"
                                 "خیر");
        break;
    case 4:
        ui->textBrowser->setText("می‌‏توانم کالاهایی که موجود نیستند را سفارش بدهم؟\n"
                                 "خیر، کالاهایی که دارای قیمت هستند ، امکان ثبت دارند.\n"
                                 "آیا تعداد خرید از یک کالا در دیجی‌کالا محدودیتی دارد؟\n"
                                 "بله. شما تنها میتوانید به تعدادی که هنگام ثبت سفارش به شما دسترسی داده شده است ، خرید انجام دهید. خریدهای تعدادی پس از ثبت نهایی بررسی و در صورت امکان تایید خواهد شد.\n"
                                 "میتوانم سفارش خود را در محل پرداخت کنم؟\n"
                                 "بله شما میتوانید وجه سفارش خود را هنگام تحویل کالا با دستگاه کارتخوان پرداخت کنید، در برخی موارد امکان پرداخت سفارش در محل وجود ندارد.");
        break;
    case 5:
        ui->textBrowser->setText("حریم خصوصی\n"
                                 "دیجی‌کالا با تاکید بر احترامی که برای حریم شخصی کاربران قائل است، برای خرید، ثبت نظر یا استفاده از برخی امکانات وب‌سایت اطلاعاتی را از\n"
                                 "کاربران درخواست می‌کند تا بتواند خدماتی امن و مطمئن را به کاربران ارائه دهد. برای پردازش و ارسال سفارش، اطلاعاتی مانند آدرس، شماره تلفن\n"
                                 "و ایمیل مورد نیاز است و از آنجا که کلیه فعالیت‌های دیجی‌کالا قانونی و مبتنی بر قوانین تجارت الکترونیک صورت می‌گیرد و طی فرایند خرید،\n"
                                 "فاکتور رسمی و بنا به درخواست مشتریان حقوقی گواهی ارزش افزوده صادر می‌شود، از این رو وارد کردن اطلاعاتی مانند نام و کد ملی برای اشخاص\n"
                                 "حقیقی یا کد اقتصادی و شناسه ملی برای خریدهای سازمانی لازم است. یادآوری می‌شود آدرس ایمیل و تلفن‌هایی که مشتری در پروفایل خود ثبت\n"
                                 "می‌کند، تنها آدرس ایمیل و تلفن‌های رسمی و مورد تایید مشتری است و تمام مکاتبات و پاسخ‌های شرکت از طریق آنها صورت می‌گیرد.");
        break;
    case 6:
        ui->textBrowser->setText("شرایط و قوانین استفاده از سرویس‌ها و خدمات دیجی‌کالا\n"
                                 "کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات و برنامه‌‏های کاربردی دیجی‌کالا به دقت ملاحظه فرمایید.\n"
                                 "ورود کاربران به وب‏‌سایت دیجی‌کالا هنگام استفاده از پروفایل شخصی، طرح‏‌های تشویقی، ویدئوهای رسانه تصویری دیجی‌کالا و سایر خدمات ارائه شده توسط\n"
                                 "دیجی‌کالا به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از سرویس‌‏ها و خدمات دیجی‌کالا است. توجه داشته باشید که ثبت سفارش نیز\n"
                                 "در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین دیجی‌کالا از سوی کاربر است. لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه توافق‏‌های قبلی\n"
                                 "محسوب می‏‌شود");
        break;
    case 7:
        ui->textBrowser->setText("info@digikala.com");
        break;
    case 8:
        ui->textBrowser->setText("۰31 - ۶۱۹۳۰۰۰۰");
        break;
    default:
        // :|
        break;
    }

}

ToBeKnownDialog::~ToBeKnownDialog()
{
    delete ui;
}
